x_1 = int(input())
y_1 = int(input())
r_1 = int(input())
x_2 = int(input())
y_2 = int(input())
r_2 = int(input())
c = 0
if r_2 > r_1:
    c = r_1
    r_1 = r_2
    r_2 = c
    c = x_1
    x_1 = x_2
    x_2 = c
    c = y_1
    y_1 = y_2
    y_2 = c
if (x_1 - x_2) ** 2 + (y_1 - y_2) ** 2 > (r_1 + r_2) ** 2:
    print('Окружности лежат одна вне другой, не касаясь')
elif (x_1 - x_2) ** 2 + (y_1 - y_2) ** 2 == (r_1 + r_2) ** 2:
    print('Окружности имеют внешнее касание')
elif (x_1 - x_2) ** 2 + (y_1 - y_2) ** 2 < (r_1 - r_2) ** 2:
    print('Одна окружность лежит внутри другой, не касаясь')
elif (x_1 - x_2) ** 2 + (y_1 - y_2) ** 2 == (r_1 - r_2) ** 2:
    print('Окружности имеют внутреннее касание')
elif (x_1 - x_2) ** 2 + (y_1 - y_2) ** 2 < (r_1 + r_2) ** 2:
    print('Окружности пересекаются')


